Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS4C.xml
        <register name="CHER" offset="0x4" rw="W" size="4" initval="0x00000000" caption="Channel Enable Register">
          <bitfield name="CHE" caption="Channel Enable" mask="0xFFFFFFFF" values="PEVC_CHER__CHE"/>
        </register>
        <register name="CHDR" offset="0x8" rw="W" size="4" initval="0x00000000" caption="Channel Disable Register">
          <bitfield name="CHD" caption="Channel Disable" mask="0xFFFFFFFF" values="PEVC_CHDR__CHD"/>
        </register>
        <register name="SEV" offset="0x10" rw="W" size="4" initval="0x00000000" caption="Software Event">
          <bitfield name="SEV" caption="Software Event" mask="0xFFFFFFFF" values="PEVC_SEV__SEV"/>
        </register>
        <register name="BUSY" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Channel / User Busy">
          <bitfield name="BUSY" caption="Channel Status" mask="0xFFFFFFFF" values="PEVC_BUSY__BUSY"/>
        </register>
        <register name="TRIER" offset="0x20" rw="W" size="4" initval="0x00000000" caption="Trigger Interrupt Mask Enable Register">
          <bitfield name="TRIE" caption="Trigger Interrupt Enable" mask="0xFFFFFFFF" values="PEVC_TRIER__TRIE"/>
        </register>
        <register name="TRIDR" offset="0x24" rw="W" size="4" initval="0x00000000" caption="Trigger Interrupt Mask Disable Register">
          <bitfield name="TRID" caption="Trigger Interrupt Disable" mask="0xFFFFFFFF" values="PEVC_TRIDR__TRID"/>
        </register>
        <register name="TRIMR" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Trigger Interrupt Mask Register">
          <bitfield name="TRIM" caption="Trigger Interrupt Mask" mask="0xFFFFFFFF" values="PEVC_TRIMR__TRIM"/>
        </register>
        <register name="TRSR" offset="0x30" rw="R" size="4" initval="0x00000000" caption="Trigger Status Register">
          <bitfield name="TRS" caption="Trigger Interrupt Status" mask="0xFFFFFFFF" values="PEVC_TRSR__TRS"/>
        </register>
        <register name="TRSCR" offset="0x34" rw="W" size="4" initval="0x00000000" caption="Trigger Status Clear Register">
          <bitfield name="TRSC" caption="Trigger Interrupt Status Clear" mask="0xFFFFFFFF" values="PEVC_TRSCR__TRSC"/>
        </register>
        <register name="OVIER" offset="0x40" rw="W" size="4" initval="0x00000000" caption="Overrun Interrupt Mask Enable Register">
          <bitfield name="OVIE" caption="Overrun Interrupt Enable" mask="0xFFFFFFFF" values="PEVC_OVIER__OVIE"/>
        </register>
        <register name="OVIDR" offset="0x44" rw="W" size="4" initval="0x00000000" caption="Overrun Interrupt Mask Disable Register">
          <bitfield name="OVID" caption="Overrun Interrupt Disable" mask="0xFFFFFFFF" values="PEVC_OVIDR__OVID"/>
        </register>
        <register name="OVIMR" offset="0x48" rw="R" size="4" initval="0x00000000" caption="Overrun Interrupt Mask Register">
          <bitfield name="OVIM" caption="Overrun Interrupt Mask" mask="0xFFFFFFFF" values="PEVC_OVIMR__OVIM"/>
        </register>
        <register name="OVSR" offset="0x50" rw="R" size="4" initval="0x00000000" caption="Overrun Status Register">
          <bitfield name="OVS" caption="Overrun Interrupt Status" mask="0xFFFFFFFF" values="PEVC_OVSR__OVS"/>
        </register>
        <register name="OVSCR" offset="0x54" rw="W" size="4" initval="0x00000000" caption="Overrun Status Clear Register">
          <bitfield name="OVSC" caption="Overrun Interrupt Status Clear" mask="0xFFFFFFFF" values="PEVC_OVSCR__OVSC"/>
        </register>
        <register name="CHMX" offset="0x100" rw="RW" size="4" count="19" count-param="TRIGOUT_BITS" initval="0x00000000" caption="Channel Multiplexer">
          <bitfield name="EVMX" caption="Event Multiplexer" mask="0x3F" values="PEVC_CHMX__EVMX"/>
          <bitfield name="SMX" caption="Software Event Multiplexer" mask="0x100" values="PEVC_CHMX__SMX"/>
        </register>
        <register name="EVS" offset="0x200" rw="RW" size="4" count="31" count-param="EVIN_BITS" initval="0x00000000" caption="Event Shaper">
          <bitfield name="EN" caption="Event Shaper Enable" mask="0x1" values="PEVC_EVS__EN"/>
          <bitfield name="IGFR" caption="Input Glitch Filter Rise" mask="0x10000" values="PEVC_EVS__IGFR"/>
          <bitfield name="IGFF" caption="Input Glitch Filter Fall" mask="0x20000" values="PEVC_EVS__IGFF"/>
          <bitfield name="IGFON" caption="Input Glitch Filter Status" mask="0x40000"/>
        </register>
        <register name="IGFDR" offset="0x300" rw="RW" size="4" initval="0x00000000" caption="Input Glitch Filter Divider Register">
          <bitfield name="IGFDR" caption="Input Glitch Filter Divider Register" mask="0xF"/>
        </register>
        <register name="PARAMETER" offset="0x3f8" rw="R" size="4" initval="0x14061824" caption="Parameter">
          <bitfield name="IGF_COUNT" caption="Number of Input Glitch Filters" mask="0xFF"/>
          <bitfield name="EVS_COUNT" caption="Number of Event Shapers" mask="0xFF00"/>
          <bitfield name="EVIN" caption="Number of Event Inputs / Generators" mask="0xFF0000"/>
          <bitfield name="TRIGOUT" caption="Number of Trigger Outputs / Channels / Users" mask="0xFF000000"/>
        </register>
        <register name="VERSION" offset="0x3fc" rw="R" size="4" initval="0x00000200" caption="Version">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="PEVC_CHSR__CHS">
        <value name="0" caption="Channel j Disabled" value="0"/>
        <value name="1" caption="Channel j Enabled" value="1"/>
      </value-group>
      <value-group name="PEVC_CHER__CHE">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Enable Channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_CHDR__CHD">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Disable Channel j" value="1"/>
      </value-group>
