Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS4C.xml
        <register name="UPCON3SET" offset="0x5fc" rw="W" size="4" initval="0x00000000" caption="Pipe Control Set Register">
          <bitfield name="RXINES" caption="RXINE Set" mask="0x1"/>
          <bitfield name="TXOUTES" caption="TXOUTE Set" mask="0x2"/>
          <bitfield name="TXSTPES" caption="TXSTPE Set" mask="0x4"/>
          <bitfield name="PERRES" caption="PERRE Set" mask="0x8"/>
          <bitfield name="NAKEDES" caption="NAKEDE Set" mask="0x10"/>
          <bitfield name="ERRORFIES" caption="ERRORFIE Set" mask="0x20"/>
          <bitfield name="RXSTALLDES" caption="RXSTALLDE Set" mask="0x40"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x400"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="FIFOCONS" caption="FIFOCON Set" mask="0x4000"/>
          <bitfield name="PFREEZES" caption="PFREEZE Set" mask="0x20000"/>
          <bitfield name="INITDTGLS" caption="INITDTGL Set" mask="0x40000"/>
          <bitfield name="INITBKS" caption="INITBK Set" mask="0x80000"/>
        </register>
        <register name="UPCON4SET" offset="0x600" rw="W" size="4" initval="0x00000000" caption="Pipe Control Set Register">
          <bitfield name="RXINES" caption="RXINE Set" mask="0x1"/>
          <bitfield name="TXOUTES" caption="TXOUTE Set" mask="0x2"/>
          <bitfield name="TXSTPES" caption="TXSTPE Set" mask="0x4"/>
          <bitfield name="PERRES" caption="PERRE Set" mask="0x8"/>
          <bitfield name="NAKEDES" caption="NAKEDE Set" mask="0x10"/>
          <bitfield name="ERRORFIES" caption="ERRORFIE Set" mask="0x20"/>
          <bitfield name="RXSTALLDES" caption="RXSTALLDE Set" mask="0x40"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x400"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="FIFOCONS" caption="FIFOCON Set" mask="0x4000"/>
          <bitfield name="PFREEZES" caption="PFREEZE Set" mask="0x20000"/>
          <bitfield name="INITDTGLS" caption="INITDTGL Set" mask="0x40000"/>
          <bitfield name="INITBKS" caption="INITBK Set" mask="0x80000"/>
        </register>
        <register name="UPCON5SET" offset="0x604" rw="W" size="4" initval="0x00000000" caption="Pipe Control Set Register">
          <bitfield name="RXINES" caption="RXINE Set" mask="0x1"/>
          <bitfield name="TXOUTES" caption="TXOUTE Set" mask="0x2"/>
          <bitfield name="TXSTPES" caption="TXSTPE Set" mask="0x4"/>
          <bitfield name="PERRES" caption="PERRE Set" mask="0x8"/>
          <bitfield name="NAKEDES" caption="NAKEDE Set" mask="0x10"/>
          <bitfield name="ERRORFIES" caption="ERRORFIE Set" mask="0x20"/>
          <bitfield name="RXSTALLDES" caption="RXSTALLDE Set" mask="0x40"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x400"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="FIFOCONS" caption="FIFOCON Set" mask="0x4000"/>
          <bitfield name="PFREEZES" caption="PFREEZE Set" mask="0x20000"/>
          <bitfield name="INITDTGLS" caption="INITDTGL Set" mask="0x40000"/>
          <bitfield name="INITBKS" caption="INITBK Set" mask="0x80000"/>
        </register>
        <register name="UPCON6SET" offset="0x608" rw="W" size="4" initval="0x00000000" caption="Pipe Control Set Register">
          <bitfield name="RXINES" caption="RXINE Set" mask="0x1"/>
          <bitfield name="TXOUTES" caption="TXOUTE Set" mask="0x2"/>
          <bitfield name="TXSTPES" caption="TXSTPE Set" mask="0x4"/>
          <bitfield name="PERRES" caption="PERRE Set" mask="0x8"/>
          <bitfield name="NAKEDES" caption="NAKEDE Set" mask="0x10"/>
          <bitfield name="ERRORFIES" caption="ERRORFIE Set" mask="0x20"/>
          <bitfield name="RXSTALLDES" caption="RXSTALLDE Set" mask="0x40"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x400"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="FIFOCONS" caption="FIFOCON Set" mask="0x4000"/>
          <bitfield name="PFREEZES" caption="PFREEZE Set" mask="0x20000"/>
          <bitfield name="INITDTGLS" caption="INITDTGL Set" mask="0x40000"/>
          <bitfield name="INITBKS" caption="INITBK Set" mask="0x80000"/>
        </register>
        <register name="UPCON7SET" offset="0x60c" rw="W" size="4" initval="0x00000000" caption="Pipe Control Set Register">
          <bitfield name="RXINES" caption="RXINE Set" mask="0x1"/>
          <bitfield name="TXOUTES" caption="TXOUTE Set" mask="0x2"/>
          <bitfield name="TXSTPES" caption="TXSTPE Set" mask="0x4"/>
          <bitfield name="PERRES" caption="PERRE Set" mask="0x8"/>
          <bitfield name="NAKEDES" caption="NAKEDE Set" mask="0x10"/>
          <bitfield name="ERRORFIES" caption="ERRORFIE Set" mask="0x20"/>
          <bitfield name="RXSTALLDES" caption="RXSTALLDE Set" mask="0x40"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x400"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="FIFOCONS" caption="FIFOCON Set" mask="0x4000"/>
          <bitfield name="PFREEZES" caption="PFREEZE Set" mask="0x20000"/>
          <bitfield name="INITDTGLS" caption="INITDTGL Set" mask="0x40000"/>
          <bitfield name="INITBKS" caption="INITBK Set" mask="0x80000"/>
        </register>
        <register name="UPCON0CLR" offset="0x620" rw="W" size="4" initval="0x00000000" caption="Pipe Control Clear Register">
          <bitfield name="RXINEC" caption="RXINE Clear" mask="0x1"/>
          <bitfield name="TXOUTEC" caption="TXOUTE Clear" mask="0x2"/>
          <bitfield name="TXSTPEC" caption="TXSTPE Clear" mask="0x4"/>
          <bitfield name="PERREC" caption="PERRE Clear" mask="0x8"/>
          <bitfield name="NAKEDEC" caption="NAKEDE Clear" mask="0x10"/>
          <bitfield name="ERRORFIEC" caption="ERRORFIE Clear" mask="0x20"/>
          <bitfield name="RXSTALLDEC" caption="RXTALLDE Clear" mask="0x40"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x400"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="PFREEZEC" caption="PFREEZE Clear" mask="0x20000"/>
          <bitfield name="INITDTGLC" caption="INITDTGL Clear" mask="0x40000"/>
          <bitfield name="INITBKC" caption="INITBK Clear" mask="0x80000"/>
        </register>
        <register name="UPCON1CLR" offset="0x624" rw="W" size="4" initval="0x00000000" caption="Pipe Control Clear Register">
          <bitfield name="RXINEC" caption="RXINE Clear" mask="0x1"/>
          <bitfield name="TXOUTEC" caption="TXOUTE Clear" mask="0x2"/>
          <bitfield name="TXSTPEC" caption="TXSTPE Clear" mask="0x4"/>
          <bitfield name="PERREC" caption="PERRE Clear" mask="0x8"/>
          <bitfield name="NAKEDEC" caption="NAKEDE Clear" mask="0x10"/>
          <bitfield name="ERRORFIEC" caption="ERRORFIE Clear" mask="0x20"/>
          <bitfield name="RXSTALLDEC" caption="RXTALLDE Clear" mask="0x40"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x400"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="PFREEZEC" caption="PFREEZE Clear" mask="0x20000"/>
          <bitfield name="INITDTGLC" caption="INITDTGL Clear" mask="0x40000"/>
          <bitfield name="INITBKC" caption="INITBK Clear" mask="0x80000"/>
        </register>
